# === Интерфейс управления ===
# Создана функция взаимодействия с пользователем.
# Функция использует экземпляры классов и их методы, реализованные ранее.
# Не дублируется функциональность, реализованная в классах.
# Интерфейс взаимодействия с пользователем реализован понятным текстом,
# т.е. в выводе не используются коллекции, только человекочитаемые строки.
# Функция взаимодействия с пользователем не перегружена.
#
# +++
# Создать функцию для взаимодействия с пользователем.
# Функция должна взаимодействовать с пользователем через консоль.
# Возможности этой функции должны быть следующими:
# ввести поисковый запрос для запроса вакансий из hh.ru;
# получить топ N вакансий по зарплате (N запрашивать у пользователя);
# получить вакансии с ключевым словом в описании.
# Помимо этого функционала, можно придумать дополнительные возможности, которые покажутся удобными.

